Autodesk.Revit.DB.View3D.ScalePerspectiveCropBox(System.Double)
Scale an existing crop box of the perspective view.
Remarks:
Remarks:
In addition to changing the view crop box, this operation also makes the change analogous to changing the scale of the orthographic view, so that both the size and scale of the view on a sheet changes according to the provided argument 'multiplier'.
For getting or setting view crop box size use property Autodesk.Revit.DB.View.CropBox
multiplier:
Multiplier to change the view scale and the current crop box size on both X and Y.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.
Since:
2024.1